[{"attraction_id":0,"name":"vancouver_city_sightseeing_tour","country":"canada","province":"british_columbia","city":"vancouver","location":{"lat":49.1978322,"lng":-123.0649959},"price":80.0,"rating":4.5,"url":"https:\/\/tripadvisor.ca\/AttractionProductDetail-g154943-d11450219-Vancouver_City_Sightseeing_Tour-Vancouver_British_Columbia.html","reviews":["Another 'Dave' Guides us Around Vancouver. Landsea’s Vancouver City Tour – Let me start this by saying if you purchase a tour in advance read the small print! Our pickup was 10am from our Downtown Hotel with an advisory to be ready 10mins before. At 09:55am panic set in. Then I...","Fantastic way to explore VC. An easy way to explore Vancouver and surroundings. Our tour guide James was genuinely passionate, fun and informative, great to be around. Visiting many sights, starting of with the beautiful Stanley Park, the Lions Gate Bridge, Granville islands markets for a lunch snack, Gastown, fantastic...","This was a great half day tour!. Was there for business for three days and have never visited the city and had just enough time for a half day tour. It was perfect and we really saw quite a bit and got a great overview of the city history, culture, nightlife and...","All the main attractions. Scott was our lovely tour guide and we spent the day with him visiting the main sights. The highlight without a doubt was the Capilano Suspension Bridge which was festooned with Christmas lights. It. Was. Stunning. Very comfortable bus, a knowledgeable tour guide and a...","Excellent Vancouver Sightseeing Tour. We would recommend this tour to anyone. Both my wife and I knew Vancouver from about 30 years ago, but had not visited since that time. We learned fun facts about the city that we never knew, even when we regularly visited the city. Ed,...","Highlight of our stay in Vancouver.. The tour was great we learned so much and had fun to. We went to several of the stops on our second day in Vancouver. This was the best way to see the city.","It was worth taking and very interesting.. I really enjoyed this tour, and I would recommend it to family and friends. You get to see alot of places and things when on the tour. it's very enjoyable.","Great Guide. Our guide\/driver Ed was a 3rd generation Vancouverite with a passion for his city. It was great to see Vancouver through his eyes, and he took extra care to help us enjoy the tour. If we had not already been to the Capilano Suspension Bridge,...","Better than Hop on Hop off for sure. We took this tour and it was amazing. Our driver and tour guide were excellent and very knowledgeable. They made every minute count and we saw everything that we wanted to. for the places that we wanted to spend more time in we went by...","Great city tour. Just finished our city tour. Really excellent! Great choice of things to see and the right amount of time at each stop. Our guide, Alexandra, is a Vancouver native so she had great details about every neighborhood and location. A great way to see the...","Excellent to see the City. We had a very informative driver and the tour was excellent. They picked us up and returned us to our hotel (great service). We really enjoyed the overview of beautiful downtown Vancouver and especially going up the elevator and seeing an overview of the entire...","Beautiful City - Great Driver with Lots of Interesting Facts. Rene picked us up at the cruise ship pier & then picked up assorted other people from downtown hotels. We enjoyed his commentary & his interaction with all of us. He made a point of learning our names! Vancouver is such a magnificent city &...","Excellent overview of Vancouver. We were driving from Bellingham early and had reserved the 4-hour city tour. Due to a horrendous traffic morning, we arrived at the River Rock Casino to be picked up a few minutes late. We had called Landsea Tours to alert them to our situation....","Vancouver overview. We were picked up at our hotel and driven around town. Our driver\/guide, Ken, was very informative and friendly. The tour is definitely worth the money if you have four hours time. It gives you an overview of the city.","Get to know Vancouver. This 4 hour tour is great for an introduction to the city on arrival as it puts the geography into perspective - at a price ($80). The pleasant and friendly driver came on time in a small comfortable bus and gave us advice on the...","Good overview of Vancouver.. Nice half day overview of Vancouver. Has the usual limitations of a minibus tour of a big city, but the tour did stop and gave us some time in Granville Island, Stanley Park. Well narrated by the bus driver. Prompt pick up at our hotel.","Great way to see the city with limited time. Hotel pickup & return..both on time. Great driver and “host.” Very informative. Saw a lot. Enough stops & slow downs for photo shoots. Very pleased with our decision to take this tour.","A fantastic city tour. We were lucky enough to take this tour two days ago, and it was nothing but fantastic. We were picked up right at our hotel right on time. The bus was comfortable and clean, audio system worked perfect. After we picked up the rest of...","Ok tour to kill time prior to flight. We took this tour to kill time prior to flight home. The tour was ok, not outstanding. We really could care less about downtown Vancouver which looked just like any other large downtown any where else. The driver\/tour guide saw himself as funny, a couple...","Excellent tour recommended. We were picked up from our hotel. It was a small minibus with about 16 people capacity. Plenty of stops all well organised and lots of information from our driver\/guide.","Awesome tour!. Yesterday our tour guide, Ed, showed us the sights of Vancouver from Coal Harbor to Stanley Park, Granville Island, Chinatown, Gas Town and the 360 degree views from the Vancouver Lookout. It was a rainy day but our group of 6 friends since high school...","Great fun!. We booked a tour for a group of six. Great sights and great information. The tour was much more than I expected! Ed was the best guide, and a great driver. We had a great time!","Best deal for short time in Vancouver. I had one full day to sightsee in Vancouver BC before boarding a cruise to Alaska. I made the best choice with Landsea. There was a problem with online booking and they moved mountains to get me to my group to join the tour. Our...","Perfect Tour. This was a great tour in 4 hours. We were promptly picked up at the set time from our hotel lobby and off we went to a number of great sights and neighborhoods. We felt our set time for each location was perfect -- not...","Best Overview and Time Well Spent. Thanks to our driver and tour guide, Ed, I would recommend this tour as one well worth the value paid. Ed did a great job of keeping us on schedule, giving us great historical background, and personal information about each of our stops because he...","Disappointing. Smoky conditions aside, this tour was nothing special. It was nice to be picked up at our hotel, but it took quite a bit of time to get everyone together and get going. Much of the time was spent driving around Stanley Park. We stopped...","Nice tour!. I was only in the city for one day - this tour was a nice way to explore the highlights of Vancouver, get a taste for some of the neighborhoods and still have some time left to explore on my own. Our driver was very...","From Disney Cruise to Airport with 9 Hours in Vancouver. Gabriel Stratulat of bcgrandtours@gmail.com gave us a wonderful tour of Vancouver when we had a 9 hour layover from the Disney Cruise, and he delivered us and our luggage to the airport in great time. He had a clean and comfortable car, and our party...","Great 4 hour tour!. We did the four hour (half-day) tour. Picked us up at the hotel, took us around to most of the Vancouver highlights. The tour guide was very thorough and the motorcoach tour bus was nice and clean and comfortable. Gave us a good amount of...","I would pass on this tour.... This tour was very disappointing. It was 3.5 hours at best. We were very rushed at the top of the Vancouver lookout- we were given 20 minutes only. At the other locations we were also just dropped off and given no “tour”. This was essentially...","Perfect length. Got to see what we wanted and time to see other sights. Har our driver was knowledgeable and very friendly. The 4 hour trip was just right amount of time to spend and the cost was extremely fair. I would recommend this trip.","Knowledgeable Driver\/Tour guide in a Comfortable Setting. A friend and I toured with Landsea Tours around Vancouver for the 4 hour city tour. For anyone wanting to get a flavor of the city without walking for hours, this was the perfect solution. We hadn't planned for Glanville Island being as interesting as...","Perfect ending in Vancouver to a perfect land\/cruise tour of Alaska. I was planning a day trip for myself, husband and 8 friends in Vancouver since we departed the cruise ship at 8:00 am and our flight cross-country to Washington was not scheduled until 8:00 pm. I was dreading the thoughts of another day of touring...","A good overview of Vancouver. Stayed an extra day after our cruise so had a limited time to visit. This was a great way to see the highlights of the city in about 5 hours total. They picked up us and dropped us off at the hotel.","Excellent tour to choose. Great tour. Very pleasant van. Guide Jeremy was the best: pleasant, knowledgeable, and personable. Gave us great info and anecdotes. Our group had a wide range of ages and interests. And we all enjoyed it. Great overview of the city. Good range of stops. Great,","Nice was to briefly see the city. Our tour started out a little ruffled. A new person at the docks and a new bus driver. With that said this tour was a great way to see Vancouver. Not driving in the area was good for us. Loved Stanley park, could have spent...","Nice tour, very pleasant guide. We wanted a quick overview of Vancouver that did not require a lot of walking. My companion uses a walker and doesn’t want to walk far, or like with a hop on hop off tour, have to get off the bus frequently. This tour was...","Private Vancouver Tour (4 Hours). The service was definitely to my expectations. We were a group of 11 and had a great time having a private shuttle all to ourselves! We were very happy with Richard, our tour guide. He was full of knowledge and truly showed us the highlights...","Great introductory tour of Vancouver. We flew into Vancouver and spent a day in the city before going on an Alaska cruise.\nI decided to do a city tour before going on our cruise.\nWe really enjoyed our tour guide, Jason, he was very knowledgeable of the city and provided...","They Need to Develop a Plan B for Rainy Days. I took the seven-hour tour, including the suspension bridge (a real highlight, even in the rain).\nThe driver was courteous and knew the city well. Comfy bus\/van, too.\nFirst stop was the totem poles in Stanley Park. Guide told us about them in the van,...","Great for Familiarization of Vancouver. We were picked up on time at our hotel. Taken to a meeting location to connect with our tour guide and other patrons - about a 10 - 15 minute wait. The tour was a promised and Sarah was a very informative guide. We were...","Great tour and staff. We took this tour before we got on the cruise ship. It happened to be Canada Day (July 1st) that day, and there were tons of people celebrating. We're glad we booked this tour as they maneuvered the city in their bus so well. Not...","Alessio is the GOAT of tour guides!. We took our teens on this tour after a week in Alaska. Alessio was very organized, punctual, knowledgeable, and kind. Excellent knowledge of Vancouver!","Perfect post-cruise tour!. We were a group of 34 just finishing a week long Alaskan cruise. Landsea was able to accommodate our party and luggage on 2 vans. We had Mikey and Meghan who were very professional and full of knowledge. We never felt rushed and even made...","Good Vancouver Tour. We ended our cruise and wanted to use up some time before our flight left at midnight, so we decided to take a tour of the city. Heather was our bus driver\/guide, and she did a very nice job of taking us around the city...","Vancouver, what a great destination . We really enjoyed our tour. Our guide\/driver was terrific! Eddie was very knowledgeable about the history of Vancouver and points of interest. We started at the Capilano Bridge, WOW what a beautiful and nerve racking place. Definitely do not miss. We then had a very...","Best Way to See Vancouver . City tours are typically like skipping a rock across a pond, but this tour offered four stops - that included Stanley Park, Granville and the Space Needle. Chris provided a great deal of historical background and narrative - as well as restaurant recommendations and shopping...","Excellent for limited time. Perfect trip and dialogue for two hours around Vancouver. We were able to see what we wanted at any stop. Excellent running commentary from the driver.","Great way to see Vancouver. As a solo traveller I was looking for a way to see the highlights of the city, so that I can decide what to do in greater detail later in my trip. This was the perfect way to do that. Alessio guided us with friendliness...","Enjoyable 4 Hours. From timely pickup at our hotel, until 4 1\/2 hours later at drop off it was great. Summer, our guide, was entertaining and informative. We saw everything people had told us to see in Vancouver. Loved it..","Very dissapointed. I booked to go on the Vancouver Highlights tour. The pickup was very efficient as we were picked up and transferred to another bus. Our driver, I cannot remember her name, said she would also act as our guide. We drove to Stanley park and...","Great Private Tour. Our experience started by booking on the phone with Allison. She was more than helpful and we ended up with a private tour paying a lot less than we would have booking a party of 4 with our ship. We were picked up by Greg...","5 hour tour well worth it !. Tour with neil he was excellent very welcoming and introduced all of the other tour group to each other\nGreat tour of the city and provided umbrellas and ponchos where required\nGreat day out with a great host","A tour well worth taking. Four of us took the Vancouver tour, and had a great time. It was a beautiful day, and starting out in beautiful Stanley Park set the tone for a lot of fun. Everyone that we dealt with in the company were great and really into...","Great tours, great guides.. We took several tours from this company during our visit to Vancouver. Aside from some traffic-related delays, which you can't blame on the tour company, everything went like clockwork. Guide commentary was both humorous and insightful. A great way to learn about the city and...","Fantastic pre cruise tour. If you are going on a cruise out of Vancouver and have the time, this is the tour for you. They pick you up at your hotel, take care of your luggage and give a great city tour. You see Stanley Park and make several...","Perfect way to see the city. If you just have 1-2 days in the city this tour is a wonderful way of see the sights and not have to bother with parking a car! The service was excellent (on time, hotel pick up and drop off) and I loved being able..."]},{"attraction_id":1,"name":"vancouver_to_victoria_and_butchart_gardens_tour_by_bus","country":"canada","province":"british_columbia","city":"vancouver","location":{"lat":49.1978322,"lng":-123.0649959},"price":210.0,"rating":5.0,"url":"https:\/\/tripadvisor.ca\/AttractionProductDetail-g154943-d11450220-Vancouver_to_Victoria_and_Butchart_Gardens_Tour_by_Bus-Vancouver_British_Columbia.html","reviews":["Canada. I was there in 2004 and below it only gives dates to fill in of 2018 and 2019. This was an old limestone quarry where the Butchart family sold cement and because it left such a big hole they decided to give something back to...","Vancouver Islands Great Garden. This amazing Garden, created in an old worked out quarry is absolutely stunning. If you like visiting gardens and you just happen to be on Vancouver Island, perhaps in Victoria you have just got to make this a must see place. And even if you...","Great Guide\/driver. Had a lovely with with a great driver and guide who knew her business. She explained everything fully and was full of excellent suggestions. We were picked up on time and dropped off at the hotel door. There was a major car accident on our...","Wow what beautiful gardens!. Great bus tour, driver was knowledgeable and courteous. Was disapointed they did not pick up at my hotel afte telling me they did. We had to walk about three blocks.","Victoria and Butchart Gardens Tour. My wife and I booked this Tour on the internet several months ago, after reading the reviews on Trip Advisor. We went in October 2018.\nThe Bus Driver was punctual with the Hotel pick up. He had a good sense of humour and excellent customer...","It's a guaranteed hit!. I have visited these gardens many times over the last thirty years and my most recent visit was last month with my wife. Everything about this place is wonderful, from the efficiently organized parking spaces, though the splendour of the floral exhibits, great restaurant, and...","Enriching Day. We booked our trip with Land Sea Tours. Our guide was Tim and he was a gem! Very informative, humorous, kind and very thoughtful. The trips highlights for us were three things, the ferry ride which was relaxing and full of beauty, the Buchart Gardens...","Buchart Gardens. Ed did an excellent job giving us all kinds of information all throughout our trip! I would highly recommend this company!","a very pleasant trip. our tour guide was very professional and helpful. he made the bus journey not boring by his stories and historic backgrounds of the destinations.","Best tour. We went on a tour to Victoria and Buchart gardens with Land Sea Tours. Our tour guide\/bus driver Mikey was the best. Very informative commentary and lots of laughs. Victoria is such a beautiful quaint town with lots of great attractions and places to eat....","Gorgeous gardens, disappointing tour. The tour was very well organised and efficiently run. However we were very disappointed at the small amount of time we were able to spend at the Butchart Gardens (just under 2 hours) especially when compared with a 3-hour stop in Victoria. We ended up...","Great tours but limited time to explore. My mother and I were looking forward to our tours of Victoria and Butchart Gardens. We only wish we had more time to enjoy each place.\nOur guide, Andy, couldn’t have been nicer. He was young, enthusiastic and informative. He picked us up at our...","Beautiful!. It is a FULL day so I would not plan on doing anything after. The tour was really lovely and our driver, Chris, gave us wonderful pieces of history all day long. The island and the garden are gorgeous! I wouldn't mind spending the night...","Exceeded our expectations. No one visiting Vancouver should miss this day tour. It is just fascinating. Butchart gardens is a work of love and art. Victoria is beautiful!","Wonderful tour, a bit too hurried. Any tour from Vancouver to Victoria and the Butchart Gardens and back in one day is bound to be rushed. This company made the trip as informative and pleasant as possible. We loved the whole day, but it’s a really long way to travel. Everything...","Must do!. I was skeptical about going on an all day tour and thought the cost was a bit high. I was wrong. Cost to get in the gardens is nearly $40 per person and the ferry ride both ways is a fee per vehicle plus a...","Absolutely beautiful!!!. Even for a person like me that is not really into gardening, I was blown away with the Butchart Gardens. The nicest gardens I ever saw. Very well laid out. My only critic is there were no fish in the ponds. Nice place to get...","Excellent day out. At first glance this day tour looks expensive and long. However, it is worth both the time and the money. We enjoyed our free time in Victoria and the Gardens were a real treat. We looked at arranging this trip independently but realised that each...","Beautiful, best seen late morning. We recently went with friends. The men weren’t too keen at first but enjoyed it as much as the women. I would recommend going by car, not a tour. Much cheaper and you can spend as much time as you want.","Victoria Scenic Tour. Long tour - Hotel pickup at 7:50am. Back to Hotel at 9:30pm.\nTook BC Ferry from Twassawasan to Vancouver Island and had about 3 hours to enjoy Victoria Town. Then drove to Butchart Gardens for a 2 hour stop. I’m not into Flora, but this...","Simply Beautiful. A visit to Victoria is not complete without a stop at Butchart Gardens. When we were planning our trip to the west coast many people said we would miss the beautiful blooms in the Gardens by going in October and it's true some plants had...","Great way to kill a day. 7:30-8:00am Hotel pickup - 8:30-9:00pm drop off it’s a full day. One hour bus ride to ferry terminal, 1.5 hrs to Vancouver Island 40m down to Victoria 3 hrs to wander on your own then an hour to the gardens and 2.5 hrs in the...","Well recommended tour. Just about everything worked well on this trip.The hotel pickup was courteous and on time. The trip onto the ferry and off again was seamless. The cruise to and from Vancouver island was very pleasant. Shopping and lunch opportunities were just about the correct length...","Excellent Day!. This was one of the highlights of our trip. I am glad I did my research beforehand and booked several weeks in advance. It is a long day but totally worth it and our driver\/guide was superb. It's great because he told us a lot...","Worthwhile Tour. Punctual pick-up from hotel, pleasant ferry ride to & from Victoria, plenty to see & multitude of eating options in Victoria and the Gardens were brilliant.\nExcellent driver, Steve, who was informative, helpful and entertaining.\nNot a cheap tour but definitely worthwhile","Wonderful color!. Butchart gardens has wonderful color and makes a great location for family pictures. There's really not enough time on this tour to see a lot of Victoria, but what we did see was excellent. Our driver, Kaitlyn, was very informative and a good driver. The...","Door to door aervie. Was picked up at downtown hotel. Our guide, Tim was awesome! About an hour bus ride to ferries, they pull the bus right on the ferry and the ride to Vancouver island was about 90 minutes. Very smooth ride over the about a 30 min...","More Sightseeing Time \/ Less Travel Time. I can tell you that Victoria is surely a place for everyone to see, and Butchart Gardens shows off Mother Nature at her best....and when you couple that with a great tour guide like Woolf....you are justified in asking me why I did not rate...","The very best way to see Victoria and Butchart Gardens. As a seasoned traveler, I thought I would be able to plan this upon arrival in Vancouver. While I looked into this, I realized that we needed transportation to the ferry, ferry tickets, transportation from the landing to Victoria, Butchart Gardens, return the ferry and...","Very Good Experience - Plan for Late Dinner. Long day with two 90 minute ferry rides but well worth the experience. Gardens are beautiful and guide was very pleasant and knowledgeable. I would recommend this tour but keep in mind that it is 13 long hours and you will need to plan for...","Enjoyable. It was a LONG day but we knew this in advance. Summer was our tour guide and she was very upbeat and knowledgeable. The bus rides and ferry rides were beautiful and with Summer's help we learned a lot about the area. Due to limited...","Interesting day out. Long day but well worth the visit. Hadn't planned to go and didn't know anything about the gardens but I soon had a history lesson. What an amazing feet! The gardens are beautiful in every way. Interesting and extremely clever.\nVictoria was interesting as well....","Gardens make this a worthwhile trip. One could argue that this is a lot to squeeze into one day trip. The time in Victoria is a little too short. However, the reward is the appropriate amount of time given to the spectacular Butchart Gardens, which are outstanding. The ferry trip is...","Excellent day trip. This was a full day from hotel pick up at 7:35am to drop off at 10pm. The time went by very quickly, we had an excellent guide Alessio who mapped out the day for us, giving us tips on where to eat, how long we...","Great day, great tour guide. Full day with a nice balance of guide and explore time. Butchart Gardens absolute highlight.\nRoaming around downtown was quick but good for first visit. Possible to consider seaplane if more time wanted on Island vs time in ferry.\nStaff were FABULOUS!","Flowers and stories. A great trip with our story-telling, lovable driver\/guide Alessio. I was dubious about this long day trip, and certainly the ferry ride was pretty tedious, but he really made the day sing with his obvious delight in sharing his knowledge, including tips on how to...","Not to be missed. 4 adults and 2 children 5 &3) had a wonderful time at Butchart Gardens. The staff was super accommodating and we were able to get an extra stroller so both kids stayed contained and happy. They loved the carousel and the adults loved the flowers....","Vancouver Island. The tour we took to Vancouver Island was with Land and Sea with Katlyn being driver\/guide. She was very interesting to listen to and had some great stories. We had lots of choices with the Butchart Gardens being the highlight of the day. The gardens...","The Way to Do It. If you are visiting Vancouver from out East, adding a day trip to Victoria and Butchart Gardens makes a lot of sense. The question is: how to get there. You can take a sea plane. You can take a whale watching cruise that goes there....","Great tour - Victoria and Butchart Gardens. If you are staying in Vancouver you will find it's a bit of a pain to tour Vancouver Island. That's where Landsea comes in.\nOn time hotel pickup followed by drive to the BC Ferry. 90 minute crossing, then on to Victoria where we had...","Blooms 365 days a year. Beautiful gardens to stroll at your own pace. Self guided tour with a map thru the rose garden, sunken garden and the Japanese maple garden. Go early in the day as it does get crowded. Considerably warmer in land than at the waterfront.","Award winning tour guide Megan. The sites in Victoria were stunning! Especially enjoyed the Empress hotel and its lovely grounds. The ferry ride was an experience in itself! And the crowning touch of the tour were The Butchart Gardens.....just wow!! The day was made extra special by a vibrant personality...","Butchart Gardens tour by Bus from ships. wonderful experience -- went late afternoon because of time ship docked. Well worth the money and convenience.\nGorgeous flowers fabulous color -- not so much to buy in gift shop. Would go back for a longer stay.","Victoria by ferry. Pick up from hotel went smoothly and on time. Driver\/guide was excellent and we had plenty of time at each stop. Loved Victoria plenty of great places to eat and choice of cuisine and prices. Buchart Gardens was amazing. Wear good walking shoes. Overall a...","The Travelin' Beez from Upstate NY....... We had heard that a trip to Vancouver is not complete unless it included a visit to Vancouver Island and the famed Butchart Gardens. We planned for this day-long tour after completing a 14 day Alaskan cruise. The thought of another long day of touring...","Victoria-us!. After a long week plus of cruising we were kind of dreading getting up early once again for a 13 hour day. But I tell you what it was worth it! Our guide Brandon was great! Throughout the trip he told us interesting facts about...","Long day trip but memorable. It's a long day trip (~13 hours) and you will spend a lot of time on commute. However, it's a memorable experience and our tour guide was really nice!","well organized and well executed first class group!. driver was early,set a nice tone. First class tour operator as everything went off without a hitch, Shout out to Alex for leading our group and being an overall great tour guide!\nWould not have changed a thing. BTW if you get Alex, make sure...","spectular. Put this on your Bucket List - world wide known - people come from all over to see these gardens and they are right in our back yard","Holiday . Brilliant display on a hot summer day. Toured with Landsea day trip which was great. Yes more time would be great but we got great value for a day trip","No stress of driving. My husband wanted to drive ourselves but there was no booking available on BC Ferries website to leave Victoria on the day we wanted, July is busy. So we ended up doing this tour and I was so glad we did. First of all not...","wonderful trip. Well organized. Everything is on time. The tour guide is knowledgeable about the neighborhood, the ship is comfortable, and the meal provided on the ship is very good for the price. Downtown Victoria and the garden are beautiful!","If you don't have a car, Landsea Tours is the way to go. Booked this day trip from the Four Seasons concierge. This was a good day. Nice bus. Traveled from our hotel downtown to the BC Ferries boat for a 2+ hour ride to Victoria. Bus went into Victoria City and dropped us off for several hours...","Great day. A long but thoroughly enjoyable day. Victoria was good but as a keen gardener I just loved Butchart Gardens. Spectacular!!\nOur tour guide Alessio was wonderful! Knowledgeable, friendly , funny. Really made our day and clearly very popular with all the other travellers too.\nWell...","Tour guides lacking. We were fastly picked up from our hotel and from there we spent an hour to get the ferry. There we had time to leave the bus and use the washroom. Our guide Alessio while knowledgeable couldn't connect with guests and made for a long...","Beautiful - wish we'd had more time. I would love to spend an entire day enjoying these glorious gardens. The bus trip was also very informativ and worthwhile.","Sailing Vancouver to Victoria and Ron's Butchart gardens in bloom! Graham in command.. Grateful to Tim (hotel pick up),Graham and Megan. We booked online and confimed. Tim arrived to the Trump International Hotel & Tower before scheduled time. After 13.5 hours with this \"triage\" team, I report in earnest. Some books thrown on floor?\nGraham engaged each couple...","Highly Recommend. We booked this tour hoping to get a good experience of Victoria since we had heard it was a must do and we were not disappointed. Our driver & guide, Joe, did an excellent job of pointing out interesting places, facts and recommending places to...","Fantastic day. Full day pick up from our hotel to the port which took 40 mins drive from downtown Vancouver. The ferry crossing was 1hr 30. We were then driven to Victoria where we had approx. 3-4 hours to walk around this beautiful city. After we had...","Highly recommend. Our guide & driver Mollie made all the difference on our tour, Booking with Allison was excellent.. On July 11, 2018, we engaged Landsea Tours for a private charter for ten family members-6 adults and 4 children. Booking through Allison was smooth and she clearly communicated all aspects. This tour was about 15 hours long and Mollie kept everyone in a good...","Fantastic day! . As we had only a few days in Vancouver, decided the tour to Vancouver Island would be a good way to see the sights there in a short amount of time. What a good decision. Landsea tours are very well organised, with a couple of...","Our Driver\/Tour Guide, Alex, did an outstanding job!. Our party of 4 was picked up by Alex on July 1st at 8 am. He was courteous, friendly and very knowledgeable about Vancouver Island, Victoria, the Butchart Gardens and surrounding area. A long day, but he made it very enjoyable. Definitely a highlight for...","Best Bus Tour Company in Canada. We were in Vancouver BC for 9 days and took a number of Bus Tours, and the Landsea services were the best. Pick up service at the hotel, on time, Excellent tour guides, so knowledgeable, as well as entertaining. Safety was always a priority and...","A Wonderful Experience. Alexis was our guide and she was amazing! Our group was 19 in number and we all were picked up at various hotels. Alexis was not only a great driver, but she was so informative. She gave history of both Vancouver, Victoria and Butchart Gardens.There...","We felt a bit rushed. We took the tour of Victoria and Butchart Gardens. Taking a tour that picked us up in Vancouver and took care of the ferry ride to Victoria was amazing. We once took the ferry there ourselves and it was stressful! Our tour guide was very...","Great day!. We added an extra day to our trip just to do the Victoria and Buscahrt Gardens tour. We were very glad we did! Our guide Gavin was very knowledgeable and entertaining! We had plenty of time to enjoy all the best of Victoria and even...","Must experience!. Beyond beautiful! The huge variety of plants, amazing grounds and ease of walking around make this a must experience location!! Worth every cent!!! We have young children and the paths are stroller friendly, no car seats needed in the shuttle bus, and everyone saw beauty...","Beautiful city’s and gardens. Our experience was wonderful. We had time to wander through Victoria, dinner at a quaint restaurant, then on to Vancouver and the gardens! Spectacular!","Brilliant Mr Ed. Tour was well organised, prompt and on time. Great being a smaller group. Our driver Ed was extremely helpful, entertaining and informative. Created a great atmosphere on the bus. On the ferry trip Ed marked helpful info on the map for each group.\nYou have...","Must see all the beautiful ROSES at Butchart Gardens. Awesome place to walk around and enjoy the beautiful roses and landscaping just breath taking. Enjoy lunch and shopping all centrally located. Will definitely go again and again!","Amazingly beautiful!. This place is so beautiful. Pictures do not do it justice. Make sure you save half the day to take in all the beauty.","Long Day....AWESOME TOUR!. Jeremy was our guide. Picked up from the Marriott Downtown Pinnacle at 7:40 am. He was funny and entertaining and then it was off to the transport boat ride which was 1.5 hours of scenery, cold weather and relaxation. Once off the boat a trip...","Excellent tour!!!!. Our tour guide MOLLIE was absolutely amazing!!!!!!!!! It's a long tour but she made it fun, relaxed, informative & comfortable!!!!!!!!!","Great city & the gardens are amazing. Long day but well worth it. The ferry rides were amazing. Then once in Victoria...so beautiful & fun. Then the gardens were so gorgeous. Standing in the quarry garden ...and smelling the aroma...must be a touch of heaven","Exactly as described on website, all went smoothly. Hotel pick-up was at about 7:00 AM and we returned back to hotel between 9:15 to 9:30 PM, so it made for a long day. But it was a very exceptional day. Our guide\/bus driver was Alessio, who was an excellent driver and an excellent...","Customized & Loved our tour from Vancouver to Victoria and Butchart Gardens. A visit to Vancouver for only a few days and a desire to take a ride in a float plane, visit Victoria and Butchart Gardens. I called LandSea tours (about 36-hours prior to my preferred departure time) and spoke to Stephanie and Sophie. They were...","I Concur with the Good Reviews. What else is there to say except that I concur with all the good reviews. We were very happy with the tour. Our guide, Alex, did a wonderful job.","Great Day on Victoria Island. Used Landsea for our day trip to Victoria Island and Butchart Gardens. They were prompt for hotel pickup, the bus\/van to the ferry was comfortable, and their drivers informative. Note that the bus goes on the ferry as well so you are with the same...","Our guide Alex, did a great job!!. The Butchart gardens were great, Victoria not as nice as expected.\nBut the guided service our guide was fantastic. Started at 7:05am and got back at 9:00pm.","Absolutely Fantastic. We were picked up on time by a very lovely young lady Sarah who was our amazing guide for the day. Due to everyone being on time and Sarah’s efficiency, we were early for our Ferry and this gave us an extra hour up our...","Colorful and Fun. I enjoyed our visit to the Gardens and we had a gorgeous day weather wise for our visit and the only disappointment was that roses weren't in bloom yet.","Lovely Day. As a solo traveller it is always good to find a tour that makes me feel comfortable and gives me some flexibility. Erich was the guide and driver for this tour and he was right on time and made me feel welcome. The other passengers...","Victoria and gardens. Pick up spot was not spot on, so check this! Once we did get picked up, our guide Alessio was so informative, helpful and a happy person, good at 6:45 AM!\nWe have been to Vancouver a few times and done a number of tours....","Absolutely Beautiful Gardens. Tour was 14 hours,but very enjoyable. Our guide,Jeremy was excellent and historically knowledgeable with interesting stories.Victoria was beautiful and Butchart Gardens was amazingly gorgeous and stunning. They should allot three hours at the Garden. The colors was off the chart. Nature should be absorbed an...","Great trip if you have some time!. We were picked up at our hotel at 9am. 40 min (approx) ride to BC Ferry terminal. (Nice terminal w food kiosks and gift shops n Starbucks ) . We had Eddie as a driver\/guide. He was awesome. Very informative and gave lots of history...","victoria tour. we had one full day to spent and luck to get first ferry in the morning . it was very easy to find the terminal . enough guidance and you can easily take your vehicle inside . comfortable hour and 1\/2 ride and you will...","Love of Gardening. What an amazing garden! Such an inspiration being I would rather be in the garden than anywhere.\nBoat and bus trip were fun to get there. Our bus driver was very informative and we learned a lot about the area.\nVictoria was a neat city....","day out. this is the most delightful afternoon you need several hours to wander around the gardens gift shop and coffee shop these gardens are incredible when you think what it was and now so picturesc well worth a trip","Way too long, and over rated. This is a very long tour and a 90 minute ferry ride to get to Butchart Gardens.\nFor 160 dollars they should at least provide lunch. Upon arrival at the gardens we were only allowed to spend about 90 minutes there.\n13 hours, bus driver..."]},{"attraction_id":2,"name":"quebec_city_and_montmorency_falls_day_trip_from_montreal","country":"canada","province":"quebec","city":"montreal","location":{"lat":45.5001458,"lng":-73.5720264},"price":115.0,"rating":4.5,"url":"https:\/\/tripadvisor.ca\/AttractionProductDetail-g155032-d11448875-Quebec_City_and_Montmorency_Falls_Day_Trip_from_Montreal-Montreal_Quebec.html","reviews":["Interested City of Canada. Quebec is our beloved city with fascinated lifestyle and beautiful environment with much more things to do. It was our first experience her with local people and high ancient building rising to the sky.","Booking problem. In trying to set up this tour, this operator was not really interested in assisting us. We would be arriving at the train station a couple of blocks away from their office and they told us we should walk. That would have been after catching...","Not as expected. Let me start with the place...it is really pretty and a day trip is enough for the visit. The driver was also very nice but the tour guide wasn't too professional for example while explaining about places whilst the bus was moving he used terms...","Wonderful day in beautiful Quebec City!. Wonderful tour from start to finish! We were picked up and dropped off at the door of our hotel. The tour guide in Quebec City was outstanding! The 3 hours of free time were enjoyable beyond words. It’s like being in a French European city....","Relaxing and informative. We enjoyed our day trip. The bus picked us up at the hotel and then took us to the main depot where it was a little confusing where we needed to go to get our passes. The tour guide in Quebec city was fabulous. We...","Cold and Snowy but still great!. I've heard wonderful things about Quebec City and after deciding to spend Thanksgiving in Montreal I knew I had to book this trip. It was cold and snowy but it was still so great to experience Quebec City with the holiday decorations already up and...","Quebec in the Summertime. This year we travelled to Canada to attend the International Rotary Convention in Toronto. After the convention we travelled to Quebec City and stayed a week at the Hilton which was Ideally located near the beautiful old downtown area so we could pretty much walk...","A must go tour! . I m really glad that we didn’t miss this wonderful trip during our stay in Montreal.\nWe had this tour by gray line and we were so satisfied . The price was more high comparing to other companies but it worth. I wish we had...","Great trip!. This trip was booked through Grey Line. Their shuttle picked us up at our hotel. The driver was so personable, providing us with information along the way. Once in Quebec City, we picked up our Tour guide. She was so knowledgeable and provided us with...","Nice introduction to QC. Wish I could give it a 5 but really can't....\nDay was cold and rainy (OK not Gray Line's fault!). Driver was nice and handled bus well on drive up to Quebec City. 1 bathroom stop after 1.5 hours (total trip takes about 3 hours)....","Worth the Trip!. We took this day trip on our first full day in Montreal. It was a GREAT way to start our trip. Serge was a fun and informative driver and our guide in Quebec City was incredibly knowledgeable. Quebec City is beautiful and a must-see when...","Worth the long ride. Very glad we took the day to visit City of Quebec. What beautiful and historic city. Our city tour guide was interesting, funny, and kept a nice pace. There are many nice places to lunch so Explore and look beyond the yellow umbrellas.\nThe downside...","Great Introduction to Old Quebec City. This tour provides a nice guided introduction to old Quebec City and provides ample time for exploring the area on your own. Although the round trip bus ride from Montreal is long - 5 hours plus two 20 minute rest stops - the coach bus...","Tips for the trip. Pros: Beautiful place, lots of history, bus driver very skilled, pleasant, and entertaining.\nCons: A long day on the bus, not enough time to walk the city and shops.\nWould prefer to skip the falls-you are too far away and it’s overcrowded with tour groups....","We had a fantastic and relaxing time!. So glad we booked this tour. Tour guides were very professional. We had enough time to see the sights, take pictures, eat and enjoy our surroundings. It was one of the highlights of our vacation.","Tons of history . Fabulous tour. The guide was very knowledgeable of Quebec City and worked hard to ensure everyone had their questions answered. Accommodated one French speaking passenger quite nicely even though it was an English guided tour. QC is gorgeous, and must see if you’re visiting Quebec.","Excellent tour to get to know Quebec. The tour was great. André and Katya were excellent tour guides. We loved the city and we would love to come back soon. Totally recommend this tour.","Charming. Easy drive to Quebec on comfortable bus. Driver and tour guide friendly and knowledgable. Hits all the highlights. Provided enough free time to eat a nice lunch and shop.","A must visit destination, but do manage your expectations!. Breathtaking town built on the side of a mountain, Quebec City is truly reminiscent of Europe! There are many al fresco eateries, but outside the quaint residential streets await a myriad of souvenir shops and not much of a shopping experience for those interested in...","One of the most beautiful cities that I have visited!. If you get a chance to walk around\nQuebec, please do it. This city is worth whatever time you have to spend there and it is very clean.","Good tour of Quebec city. We took this tour as we were pressed for time and found that going by bus or train would not be very convenient. We walked to the Gray Line offices on Peel Street, as we were staying couple of blocks away. The tour started on...","Quebec City Day Trip. A fantastic trip. The Driver did a great job and then the guide in Quebec City was simply awesome.\nA place I would love to see more of, maybe an extra day there.\nBut did a tour around the Old City up top then dropped...","An excellent way to see a beautiful city. A full day excursion, since Quebec City is 3 hours from Montreal, the tour is a great introduction. The guide was expert and entertaining, and she hadn't lost her enthusiasm despite being in her 28th year of guiding! The only negative was the morning pickup....","Day Trip to Quebec City. This was a long day BUT it was totally worthwhile. Our driver was charming and entertaining and our guide Katya was superb. I got out of this tour everything that I could have hoped for in the time that was available to me and I...","must do. Quebec City & Montmorency Falls are definitely worth a trip.\nAt Montmorency falls, we were mesmerized by the rainbow at the foot of these falls. All the colours were very distinctly visible.\nQuebec City bus tour provided a good commentary of several aspects of this...","Great day trip. Last minute decision to go to Quebec City and, after looking at car rentals or train, decided it was worth having someone else do the driving and the planning. Always leery about being a tourist on a bus but the driver and guide were terrific....","One day Trip from Montreal to Quebec. Nice trip for family with young kids or friends. A lots to see. You can choose different activities according to your family's special needs.","A Don't Miss Tour. We wanted to cap off our week long visit to Montreal with a trip to Quebec City and were completely pleased with our tour with Grey Line. After checking in at their downtown office we boarded the bus with our driver Andre and were treated...","AMAZING Trip!!. My son and I went to Montreal for a long weekend in Canada. While there we decided to take this trip to Quebec City. What a GREAT experience it was!! The bus driver was very personable and our guide in the city was EXCELLENT. Just...","Day trip from Montreal. I have always wanted to go to Quebec City because of the history and architecture of the city.\nAn opportunity arose when my wife and I stayed in Montreal for a few days.\nWe saw this day trip advertised in the hotel where we stayed...","To Get a Nice Taste of Quebec City While Visiting Montreal, Take This Tour!. Both our driver and our guide once we arrived in Quebec City were very good at their jobs. Quebec City is a more European-feeling city than Montreal, and the tour began and ended in Quebec City in the quaintest part of the city which is...","Excellent Day Trip. An excellent day trip to Old Quebec City. We were picked up at our downtown Montreal hotel. After all of the hotel pickups were then dropped off at the Gray Line office to complete the paperwork and assigned to a bus for our trip. It's...","Skip the Cruise Option. The sites were beautiful, but I wish that there had been a better allotment of time. As this is a bigger tour, there were multiple instances where our time was cut short by other passengers who delayed departing sites. In fact, we barely had 10-15mins...","Great Day Trip. This trip exceeded our expectations. It was well organized and provided enough free time to explore parts of the city on our own. Our driver, Andre, was very good. I especially liked the way he made sure that everyone came back to the bus on...","Excellent guide, enjoyable trip. We were picked up at the hotel on time & changed to a large bus at the Peel Street terminal. No guide on-board and only practical comments given by the driver - suggest taking a book to read, the 3hr journey to Quebec City is...","Beautiful views - average tour. The bus was clean and on time and appreciated being dropped off back at our own hotel at the end of the day. I was disappointed that the guide on the way there (3 hours in the bus) provided little commentary on the landscape, the...","Day Excursion to Quebec City. First off let me say that we really enjoyed our Grey Lines trip to Quebec City. We went to the falls first - the height of the falls were impressive, but honestly I would have preferred to spend more time in Quebec City. There is...","WARNING: Don’t book this event through TRIP ADVISOR!!!. We realized that the date we selected was incorrect within moments of our booking. It shows an option to change the date, however the only option was to call a phone number. I immediately called- on hold for about an hour. She then told me...","Great way to spend the day and see the highlights of the city. Due to the mixed reviews on here, I was super hesitant to take this tour. We were only visiting Montreal for three days so I was scared of losing a day if it was bad. Thankfully that wasn't the case and we were so happy...","Was never picked up-refund request rejected. The company was supposed to pick me up at the hotel but never did, then they said they showed 30 min before the time mentioned on the ticket. They now refuse to give me a refund. Real thieves !","Great day trip. Wonderfull views of Quebec and the falls all from the St Lawance River, the guide was great and dressed in period clothing, he was was very informative and spoke both in english and french.","Convinient. Pick up and drop off at hotel, takes you to major sites of Quebec City. The bus driver also tells you the places the bus passes by in Montreal. However, the driver also had a very thick French accent, so he was a bit hard...","Great until the driver went crazy. This tour is really good. The driver reached outside our hotel to pick us up, did a few more n took us to the tourist centre where they gave us our tickets n put us on a bus to Quebec. It was a 3 hour...","Bus trip to Quebec City. It was wonderful! The driver was fun and the bus was clean. We had plenty of time to see the sights in Quebec City.","Informative trip. I enjoyed our trip to Quebec. We had a very good guide, Roch, and our driver was also very knowledgeable. Quebec is beautiful and the food was excellent.","Good way to see Quebec in a day from Montreal. With limited time in Montreal we opted to see Quebec on this Gray Line day trip. Everything worked fine and with military precision on timings leaving the offices in Peel at 8.00am sharp and being dropped of near our hotel in St Denis at 8.00pm....","Great daytrip . Very enjoyable day trip to Quebec City. Driver was very informative and tour guide was excellent. Got picked up at the hotel in the morning and dropped off nearby after the tour.","Full of value. Arrived at the Tourist Info office on the morning, good waiting facilities and toilets. Helpful before a long drive! Nice relaxing drive to Quebec City. Then a walking tour, a visit to the Falls for 20 mins (which was certainly enough time!) and then 3...","big disappointment! save your money!. bought two tickets for this tour over $200. the hotel told me we would be picked up at 7;30 am. no one came. the hotel called,and they picked us up at 8:10. when we arrived ,at the grayline depot which was 5 minutes,away there,were only...","Great Tour. This tour is a 12 hour trip to Quebec City from Montreal. The tour description indicates they will pick you up and drop you off at your hotel. Then you don't hear anything. I emailed, called and eventually had to go to the office at...","Nice way to spend a day. Quebec City is beautiful and definitely worth seeing. The day trip is very long but the coach is comfortable and made stops along the way.","Great value. Best $115 I ever spent. The 5 hr drive up to Quebec City was comfortable with a stop half way. The tour guide Roch was very knowledgeable and funny. It included a tour around the sites with a 3 hr on your own time break....","Awesome tour. The trip was awesome. Our guide Roch did an excellent job explaining the history and significance as we walked through the city and on the bus. In our free time later in the day, we never felt lost and just knew everything that we were...","HORRIBLE- DONT BOOK. This company should apply for worst ever customer service... they would win with no effort. Booking process is non friendly and archaic... customer service offers no service. I am not surprised they rank so poorly on ratings both on FB and trip advisor...","Grayline tour is horrible. Dirty bus, late pickup to leave from hotel, late pickup for departure for return trip. Uncaring driver who doesn’t tell the truth because he didn’t want to speak to his passengers. Walking tour guide was informative and for this large group tour projected her information...","Cruise on May. I am interested on the complete tour including the cruise for tomorrow. Is it possible?\nIt says the cruise is included on May.","Angry in Old Montreal. Nice enough tour, but ruined at the end. The bus driver made us get out at the wrong hotel at 8:30pm after a 12+ hour excursion. We were staying at Holiday Inn downtown but he made us get out at a different Holiday Inn. He...","Quebec City from Montreal. I really enjoyed this day tour. It is a long day, but is absolutely worth it. Quebec City and Montmorency Falls are beautiful.\nSpecial thanks to our driver John Pierre for doing an excellent job of getting us there safely and on time (and for...","Perfect day trip!. Everything ran very smoothly! Well worth the cost to see this beautiful city. The falls were beautiful and the guide was very passionate and knowledgeable. Book early it was sold out!","What a beautiful city. Having not being able to fly into the city, I went on this tour not knowing what to expect.\nBut, I am so happy to have come here even just for a day away from Montreal.\nIt's well worth it.\nAwesome bus driver too","Classy historical heritage. The city is full of gorgeous testaments to its continental roots. Tour guide was very friendly and knowledgeable.\nMy visit is in April so it's still snowing a lot here, but on the upside I get to avoid the summer crowd so it's very nice.","Nicely Done Tour !!. We debated on whether or not to take a day to see Quebec City since we were in Montreal for a few days. So glad we did this. This is a full day! The bus ride is long like 2.5 to 3 hours but this...","beautiful city. the falls is really just a flash visit, just enough to look at them and return to the bus. this was ok for us but there where people that wanted to take a closer look and we did not have enough time.\nin Quebec a...","Historical City . Had a great experience of this tour, tour guide has full of knowledge of this old town, nice and helpful.","Excellent tour. This was an amazing day full of beauty & history. Such a shame it was marred by our tour guide recommending us all to eat at a restaurant at the drop off point at the end of our tour before our free time, it was...","Good, Quick Introduction to Quebec City. This trip was a good introduction to Quebec City. We didn't spend much time at Montmorency Falls—in hindsight, I'd rather have spent the extra hour in Quebec City, but our tour guide was exceptional and his anecdotes were worth the time in the bus.\nQuebec...","The high point was the Cathedral-Basilica of Notre-Dame de Québec. Ok, average for the amount of time you'll spend. Many tips.\n1) Call the day before to confirm your hotel pick-up. If they are 5 minutes late, call them. We called 2 days prior, and when I called 10 minutes after pick-up, they didn't have..."]},{"attraction_id":3,"name":"niagara_falls_day_trip_from_toronto","country":"canada","province":"ontario","city":"toronto","location":{"lat":43.6561507,"lng":-79.3842642},"price":169.0,"rating":5.0,"url":"https:\/\/tripadvisor.ca\/AttractionProductDetail-g155019-d11448318-Niagara_Falls_Day_Trip_from_Toronto-Toronto_Ontario.html","reviews":["Great day. It was an amazing day. The falls are wonderfull, and city has something for everyone, tower, restaurants, souvenir shops, great museums! I had avery nice time and I would recommend!","Beautiful from up close. The falls itself are defenitely beautiful, especially in these winterconditions with frozen parts. To get their size it's important to be close and to hear the massive noise from all the water falling down. That's why I would defenitely recommend doing the 'behind-the-falls' part!\nI...","beautiful waterfalls. i had been on the american side in july 2004 , and felt i little disappointed because i didnt find what i expected, then i planned a trip to canada in june 2018 , and drove to niagara and stayed 2 days, everything was different,...","Totally Worth It!!!. Beautiful Fall day well organized. Ice wine tasting delicious, buffet meal is actually overlooking the Falls and includes a lot of variety. It’s a great way to see the Falls if you’re pressed for time. If taking the Hornblower, I recommend dressing warm and with...","Fantastic day trip with great guide.. The weather was not good but our guide Judy adjusted the itinerary an route to fit in with the best weather.\nConstantly ringing forward to check on weather.\nThis delivered a great trip with all the highlights completed! Well done Judy.\nThe day trip is...","Great full day trip to Niagara and beyond. Really recommend this day trip if you have limited time In Toronto.\nPicked us up from our hotel first - there were a few more pick ups but Judy used time to give us insight to Toronto.\nTrip went via vineyard before headed to Niagara....","Guide Judy is a star!. It's a spectacular experience to see Niagara Falls in any circumstances, but we were lucky enough to be with Judy! Judy was the best guide we have ever had on any trip - and we've been on many. Informative, witty, warm and highly experienced. Really...","Judy at Grayline is fantastic !. Our experience of visiting Niagara was a tale of two parts ! We booked the night tour which was so worth seeing but the tour guide was way out of her depth when things went wrong . On complaining , Grayline were quick to refund...","Good way to satisfying sum up everything you want to travel in a day. The tour guide was friendly and good. It was a good way, to sum up, everything you want to travel in a day because of a convenient transportation to and back from Niagara Falls to Toronto, and most importantly, saving time for the need to...","Amazing. It was a amazing day, firstly to the winery where they talked about there wine and you got a taster. We unfortunately dont drink alcohol but you got grape juice instead, it was delicious. Next we did niagra falls, a defnite. Afterwards we went to...","A Good Excursion if NF is on your bucket list. First of all be prepared for a long day as this was about a 10-11 hour experience but it was a good way to see the Falls and a stop at the Whirlpool, a winery and the beautiful little town of Niagara on the Lake...","Exhausting day. It was an 11 hour very exhausting day. We stopped at 2 places outside of downtown Toronto to pick up and drop off more people which added more time. The Falls were beautiful and the cruise was fun. The buffet lunch was good. We didnt...","First Time at the Falls. Booking and confirmation was a breeze. We were picked up in front of our hotel on time. As we drove from Toronto to Niagara our tour guide shared city history. Some of the people on our tour were taking a helicopter ride so they were...","Excellent trip. We took this trip yesterday. From start to finish this was very well organised. I contacted the company from the UK before we left home to arrange pick up and the reply was prompt and clear. The actual pick up was easy and on time....","Excellent value day trip. This is an excellent day out to Niagara Falls, which we felt was not too long nor too short. Our guide, Ziqi, was very knowledgeable and had a good sense of humour, which made the day pass pleasantly. There are plenty of photo opportunities during...","WHAT A BLAST!. We didn't know what to expect on this day trip, but it far exceeded our expectation. Our guide, Grant, was entertaining and full of insight. Obviously, the most memorable part of the trip was the exhilarating boat ride. Definitely wear the poncho! The side trips...","Great trip. Really great trip, and what a sights to behold when you arrive, the day flies by, great commentary. Could have spent more time at most places","Old Bus - No WiFi. We took this trip to Niagara Falls and we were disgusted, no WiFi on the bus in this day and age is appalling. The stops are too short to even see anything. The only good thing about this tour was the guide\/bus driver Mike. Otherwise...","Wonderful Day Tour from Toronto. Took a trip to Niagara Falls with my son from Toronto. The motor coach left on time and commentary by the guide, Grant, was just the right combination of informative and self-depreciating. He had a great double-act with the driver, Peter.\nHad plenty of free...","Good tour but could be improved. It was a good tour, but we have noticed that it was way too fast. More time is needed in all places rather than just the average of 45min. There was no time to have a look at souvenirs shops after the boat ride in...","Fantastic tour!. I have to say I was so pleased with how our experience was with Gray Line. The bus was super clean w\/bathroom and our tour guide made sure our 90 minute ride was full of fun facts and stories about Toronto. We arrived in Niagara...","Barry was fantastic!. We took a day trip to Niagara Falls was it was so worth it. The bus was late picking us up but that was because of a break down so no one's fault there. There were only a few pick up points so we managed...","Excellent - Niagara Falls Day Trip!. A superb day (Tuesday 05 June 2018) and I would highly recommend Gray Line when booking this trip.\nFor my wife & I, the highlights were:\n* A very clean, comfortable coach with an excellent driver, Danny on our trip.\n* An extremely good tour...","Amazing tour!. The wine tasting was a nice added touch. It’s not something i would have chosen on my own, but i truly enjoyed it. The weather we had was gorgeous for the falls was perfect. The last part of the tour we stopped at a little...","The places we visit are nice, but the tour guide failed in creating a friendly environment. Yeah you will see the falls (witch are great no matter how you get there) and have a stop in s cute small city for shopping, but the tour is not fun at all. The tour guide was also the shuttle driver and he wasn't...","Must see. Niagra falls are fabulous. we were all given a waterproof plastic anorak to put on, as their is lots of spray from the falls. The sheer size and power is as astounding. The weather was raining but it did not stop our enjoyment.","Great Day Out. Wonderful experience. The tour guide was great, the winery amazing and the falls spectacular. Lunch at the Sheraton was good, nothing to rave about, but when you have to cater for as many people as they do, it was fine. Be careful if you are..."]}]